# NumPy Homework

# A

## 1) import numpy library with his usual alias!

In [29]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from IPython.display import display

## 2) Create a random matrix, which has 2 columns and 20 rows. With this we will then create a pandas DataFrame!

In [41]:
ratings_values = np.random.random_integers(low=0, high=5, size=(20,2))
ratings = pd.DataFrame(ratings_values, columns=['Price','Quality'])
print(ratings_values)
print()
display(ratings)

[[4 4]
 [4 1]
 [1 3]
 [2 0]
 [3 1]
 [1 0]
 [3 4]
 [1 0]
 [1 1]
 [3 4]
 [2 5]
 [0 4]
 [0 2]
 [5 1]
 [2 2]
 [3 3]
 [5 5]
 [2 2]
 [3 1]
 [5 1]]

/var/folders/m7/snhszr993kscmjx9dwlff1lm0000gn/T/ipykernel_19201/2078766822.py:1: DeprecationWarning: This function is deprecated. Please call randint(0, 5 + 1) instead
  ratings_values = np.random.random_integers(low=0, high=5, size=(20,2))

    Price  Quality
0       4        4
1       4        1
2       1        3
3       2        0
4       3        1
5       1        0
6       3        4
7       1        0
8       1        1
9       3        4
10      2        5
11      0        4
12      0        2
13      5        1
14      2        2
15      3        3
16      5        5
17      2        2
18      3        1
19      5        1

## 3) Create two vectors from the previous DataFrame. We will use the same values from the previous DataFrame which we already have been created. The first one contains the evaluations which show the customer satisfaction for the prices, and the second one contains for the quality. How big how good! We will then print the vectors.

##### Hint: pd.DataFrame['column_name'] gives us a Series from a DataFrame. We can use it with the same functions as DataFrames.

In [43]:
price =  ratings['Price']
quality = ratings['Quality']


print('Price: ', price)
print('Quality: ', quality)

Price:  0     4
1     4
2     1
3     2
4     3
5     1
6     3
7     1
8     1
9     3
10    2
11    0
12    0
13    5
14    2
15    3
16    5
17    2
18    3
19    5
Name: Price, dtype: int64
Quality:  0     4
1     1
2     3
3     0
4     1
5     0
6     4
7     0
8     1
9     4
10    5
11    4
12    2
13    1
14    2
15    3
16    5
17    2
18    1
19    1
Name: Quality, dtype: int64

## 4) Find the total numbers of visitors.

In [44]:
print(len(price))

20

## 5) Find and print the average ratings for each column using numpy functions (we will find the mean and median values)

In [45]:
print('The mean of the price ratings: ', price.mean()) # < write your code here >
print('The median of the price ratings', price.median()) # < write your code here >

print('The mean of the quality ratings: ', quality.mean()) # < write your code here >
print('The median of the quality ratings', quality.median()) # < write your code here >

The mean of the price ratings:  2.5
The median of the price ratings 2.5
The mean of the quality ratings:  2.2
The median of the quality ratings 2.0

## 6) Create a new vector which is the average of the ratings of two columns, price and quality. We will name it as mean_ratings. It will show the average rating for each customer. Round elements of the array to the nearest integer.

In [46]:
mean_ratings = ratings.mean(axis=1).round().astype(int)
mean_ratings = pd.DataFrame(mean_ratings, columns=['Average'])
print(mean_ratings)

    Average
0         4
1         2
2         2
3         1
4         2
5         0
6         4
7         0
8         1
9         4
10        4
11        2
12        1
13        3
14        2
15        3
16        5
17        2
18        2
19        3

## 7) Create ratings_values matrix again with the all three vectors. Average ratings, which has just been calculated in the previous exercise, should be the third column of the new matrix. All values in the matrix should be integer! New matrix should have 20 rows and 3 columns!

In [47]:
new_ratings_values = pd.concat([ratings,mean_ratings], axis=1)
print(new_ratings_values)
print(type(new_ratings_values))
print(new_ratings_values.shape)

    Price  Quality  Average
0       4        4        4
1       4        1        2
2       1        3        2
3       2        0        1
4       3        1        2
5       1        0        0
6       3        4        4
7       1        0        0
8       1        1        1
9       3        4        4
10      2        5        4
11      0        4        2
12      0        2        1
13      5        1        3
14      2        2        2
15      3        3        3
16      5        5        5
17      2        2        2
18      3        1        2
19      5        1        3
<class 'pandas.core.frame.DataFrame'>
(20, 3)

In [48]:
new_ratings = pd.DataFrame(new_ratings_values, columns=['Price', 'Quality', 'Average'])
display(new_ratings)

    Price  Quality  Average
0       4        4        4
1       4        1        2
2       1        3        2
3       2        0        1
4       3        1        2
5       1        0        0
6       3        4        4
7       1        0        0
8       1        1        1
9       3        4        4
10      2        5        4
11      0        4        2
12      0        2        1
13      5        1        3
14      2        2        2
15      3        3        3
16      5        5        5
17      2        2        2
18      3        1        2
19      5        1        3

# B

## 1) Create *Mean Absolute Error (MAE)* function

\begin{equation}
MAE=\frac{1}{n}\sum_{i=1}^n|target_i - predictions_i|
\end{equation}

In [49]:
def mae(target, predictions):
    absolute_errors = abs(target - predictions)
    mean_absolute_error = absolute_errors.mean()
    return mean_absolute_error

## 2) Create two arrays each of them has $100$ observations. We will use them for *target* and *predictions* labelling. The target array should consist only $0$ or $1$ values which are random created, while predictions only integer $1$. The target array should have a *binomial distribution* which gives $1$ with $60$% probability.

In [57]:
target =  np.random.binomial(1,0.6,100)
predictions = np.ones(100, dtype=int)

print(target)
print()
print(predictions)

[1 1 1 1 0 0 1 0 1 0 1 0 0 1 1 1 1 0 0 0 1 0 1 1 1 1 0 0 0 1 1 1 0 1 1 1 0
 0 1 1 0 0 1 1 1 1 1 0 0 0 1 1 1 1 0 1 1 1 1 0 1 0 1 0 0 0 0 0 1 1 1 0 1 0
 1 0 0 1 1 0 0 1 0 1 1 1 0 0 0 0 0 1 1 1 1 0 0 1 1 1]

[1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]

## 3) Find the *MAE* with your mae function

In [58]:
mean_absolute_error =  mae(target,predictions)
mean_absolute_error

0.43

## 4)  Run the code in this step. Observe the printed outputs. Try to run the codes a few times from step 2. What do you think about the results? Give your thoughts shortly with 3 - 5 sentences about why two outputs are the same. What is your conclusion?

In [59]:
print(1-np.mean(target))

print(mean_absolute_error)

0.43000000000000005
0.43

 ### Target has binomial distribution with %60 probablity which makes the mean of the target approx 0.4 . When we calculate the MAE of them it will also give approx 0.4 due to the values. It gives the same values because the prediction array has items as 1 and the mean of the target array equals to the proportions of the 1s in the array.

## 5) We have always chosen $1$ in our predictions, but the actual values at the target have changed each time. How likely is it that we got it right each time, and what determines this?

 ### Since we have chosen always 1 in our prediction, the MAE solely depends on the proportion of 1s in the target. If the proportion was 0.8 then likelihood of true prediction is going to be each time 0.8. It means even the numbers change in the target, the value be always the same as long as the distribution stays the same.

# C

## 1) Create a Pythagorean function using *np.dot()* to calculate vector length

$$v = [x, y] ==> len_v = \sqrt{x^2+y^2}$$

In [62]:
def pythagorean_length(vector):
    v = np.array([vector[0],vector[1]])
    dot_V = np.dot(v,v)
    length_v = np.sqrt(dot_V)
    return length_v

## 2) Calculate the length of the given vector using your *pythagorean_length* function and check your result comparing with the given

In [63]:
a = np.array([3, 4])

pythagorean_length(a)

5.0

## 3) Find the shortest distance (Euclidean distance) using *np.dot()* between the given two vectors and compare the results to check

In [67]:
a = np.array([5, 6])
b = np.array([1, 3])

c = np.sqrt(np.dot((a-b),(a-b)))
print('The distance between a and b is', c)

from scipy.spatial import distance
print('The distance between a and b should be', distance.euclidean(a, b))

The distance between a and b is 5.0
The distance between a and b should be 5.0

# D - Obfuscating Data

It is best to obfuscate data by multiplying the numerical features (they can be seen as the matrix $X$) by an invertible matrix $P$. 

$$
X' = X \times P
$$

Try to do that and check how the features' values will look like after the transformation. By the way, the invertible property is important here so make sure that $P$ is indeed invertible.

## 1) Protect customers' personal data. It is necessary to develop a data transformation algorithm that makes it difficult to recover personal information in case the data falls into the wrong hands. This is called data masking or data obfuscation. However, the data must be protected in such a way that the quality of the machine learning models does not suffer. You don't need to choose the best model, just prove that the algorithm works correctly.

In [101]:
# pd.DataFrame
columns = ['gender', 'age', 'salary', 'family_members']
data = np.array([np.random.choice([0, 1], size=1000), 
                 np.random.randint(18, 100, 1000), 
                 np.random.normal(25000, 5000, 1000).astype(int), 
                 np.random.randint(0, 10, 1000)
                ])

personal_data = pd.DataFrame(data.T, columns=columns)
display(personal_data.tail(10))

     gender  age  salary  family_members
990       1   35   26186               8
991       1   59   18350               9
992       0   90   16082               9
993       1   80   26673               3
994       0   65   23111               7
995       0   71   29328               3
996       1   74   24240               4
997       0   38   21730               9
998       0   65    9176               3
999       1   97   34827               9

In [72]:
# < write your code here >

In [102]:
# Generate an invertible matrix
P = np.random.rand(4, 4)  
# Ensure P is invertible
while np.linalg.matrix_rank(P) != 4:
    P = np.random.rand(4, 4)
P

array([[0.21677409, 0.42359604, 0.1258419 , 0.22735769],
       [0.69149639, 0.08110443, 0.15150332, 0.14403962],
       [0.38880204, 0.6716569 , 0.37217045, 0.80919277],
       [0.62487762, 0.01314581, 0.78506528, 0.38174521]])

**(Hint:** https://numpy.org/doc/stable/reference/random/generator.html **)**

In [103]:

transformed_personal_data = np.dot(personal_data, P)
transformed_personal_data

array([[ 9642.93929417, 16566.95516739,  9189.29154711, 19963.5059781 ],
       [ 9512.85492026, 16374.52423583,  9079.57371222, 19730.32727431],
       [ 7692.43128835, 13226.72749621,  7339.59251818, 15939.72645491],
       ...,
       [ 8480.56918813, 14598.30474968,  8100.08667813, 17592.66818094],
       [ 3614.46945845,  6168.43495327,  3427.23899737,  7435.66070053],
       [13613.72462593, 23400.20394569, 12983.46765154, 28199.39163081]])

In [104]:
transformed_personal_data = pd.DataFrame(transformed_personal_data, columns=columns)

# Display the transformed DataFrame
display(transformed_personal_data.tail(10))

           gender           age        salary  family_members
990  10210.588506  17591.375040   9757.364488    21197.844673
991   7181.156476  12330.231212   6845.457956    14860.848796
992   6320.573053  10809.004000   6005.946127    13029.837456
993  10427.928051  17922.055921   9941.503822    21596.494611
994   9034.925459  15528.026459   8616.574534    18713.288980
995  11453.757237  19704.151458  10928.127005    23743.377710
996   9478.448576  16287.441199   9035.889153    19627.246100
997   8480.569188  14598.304750   8100.086678    17592.668181
998   3614.469458   6168.434953   3427.238997     7435.660701
999  13613.724626  23400.203946  12983.467652    28199.391631

## 2) Can you guess the customers' ages or income after the transformation?

In [105]:
# Secure Data
personal_data.describe()

            gender          age      salary  family_members
count  1000.000000  1000.000000   1000.0000     1000.000000
mean      0.467000    58.248000  25012.9240        4.323000
std       0.499159    24.181755   5055.1673        2.905704
min       0.000000    18.000000   6422.0000        0.000000
25%       0.000000    37.000000  21681.7500        2.000000
50%       0.000000    58.000000  25129.5000        4.000000
75%       1.000000    79.000000  28238.2500        7.000000
max       1.000000    99.000000  41318.0000        9.000000

#### It is not possible to derive insights from the data when data obfuscation applied

## 3) Can you recover the original data from $X'$ if you know $P$? Try to check that with calculations by moving $P$ from the right side of the formula above to the left one. The rules of matrix multiplication are helpful here.

In [114]:
P_inverse = np.linalg.inv(P)
reverted_personal_data = np.dot(transformed_personal_data,P_inverse)
reverted_personal_data[:, 0] = np.round(reverted_personal_data[:, 0])
reverted_personal_data[:, 3] = np.round(reverted_personal_data[:, 3])
reverted_personal_data = pd.DataFrame(reverted_personal_data,columns = columns)
reverted_personal_data

     gender   age   salary  family_members
0      0.00 81.00 24656.00            1.00
1      0.00 52.00 24373.00            1.00
2      1.00 49.00 19686.00            7.00
3      0.00 46.00 24929.00            1.00
4      1.00 42.00 26178.00            6.00
..      ...   ...      ...             ...
995    0.00 71.00 29328.00            3.00
996    1.00 74.00 24240.00            4.00
997    0.00 38.00 21730.00            9.00
998    0.00 65.00  9176.00            3.00
999    1.00 97.00 34827.00            9.00

[1000 rows x 4 columns]

In [115]:
# Printing all three cases for a few customers
personal_data

     gender  age  salary  family_members
0         0   81   24656               1
1         0   52   24373               1
2         1   49   19686               7
3         0   46   24929               1
4         1   42   26178               6
..      ...  ...     ...             ...
995       0   71   29328               3
996       1   74   24240               4
997       0   38   21730               9
998       0   65    9176               3
999       1   97   34827               9

[1000 rows x 4 columns]

In [116]:
# Original Data
personal_data.tail(10)

     gender  age  salary  family_members
990       1   35   26186               8
991       1   59   18350               9
992       0   90   16082               9
993       1   80   26673               3
994       0   65   23111               7
995       0   71   29328               3
996       1   74   24240               4
997       0   38   21730               9
998       0   65    9176               3
999       1   97   34827               9

In [117]:
# Secure Data
transformed_personal_data.tail(10)  # < write your code here >

      gender      age   salary  family_members
990 10210.59 17591.38  9757.36        21197.84
991  7181.16 12330.23  6845.46        14860.85
992  6320.57 10809.00  6005.95        13029.84
993 10427.93 17922.06  9941.50        21596.49
994  9034.93 15528.03  8616.57        18713.29
995 11453.76 19704.15 10928.13        23743.38
996  9478.45 16287.44  9035.89        19627.25
997  8480.57 14598.30  8100.09        17592.67
998  3614.47  6168.43  3427.24         7435.66
999 13613.72 23400.20 12983.47        28199.39

In [118]:
# Recovered Data
pd.set_option('display.float_format', '{:.2f}'.format)
reverted_personal_data.astype('int').tail(10) # < write your code here >

     gender  age  salary  family_members
990       1   35   26186               8
991       1   59   18350               9
992       0   89   16082               9
993       1   79   26673               3
994       0   64   23111               7
995       0   70   29328               3
996       1   73   24240               4
997       0   37   21729               9
998       0   64    9176               3
999       1   96   34827               9

#### We can recover data using the inverse matrix but it is important to think of rounding problems to get the exact numbers back.

---

# USEFUL INFORMATIONS

##### Matrices and Matrix Operations

- **A matrix** is a rectangular numeric table or two-dimensional array consisting of m rows and n columns.
- **A transpose of the matrix** is a matrix operation when its rows become columns with the same numbers.- **Dummy code** is a simple code that doesn't mean anything.
- **An identity matrix** is a square matrix with ones on the main diagonal and zeros elsewhere.
- **An inverse matrix** for a square matrix A is a matrix A with a superscript -1 whose product with A is equal to the identity matrix.
- **Invertible matrices** are matrices that have an inverse.
- **Non-invertible** are matrices that don't have an inverse.

# Properties of Matrices

Matrices have many properties in Linear Algebra.

<table>
<tr>
<td>Distributivity</td><td>$A(B+C)=AB+AC$</td>
</tr>
<tr>
<td>Non-commutativity</td><td>$AB \neq BA$</td>
</tr>
<tr>
<td>Associative property of multiplication</td><td>$(AB)C = A(BC)$</td>
</tr>
<tr>
<td>Multiplicative identity property</td><td>$IA = AI = A$</td>
</tr>
<tr>
<td></td><td>$A^{-1}A = AA^{-1} = I$
</td>
</tr>    
<tr>
<td></td><td>$(AB)^{-1} = B^{-1}A^{-1}$</td>
</tr>    
<tr>
<td>Reversivity of the transpose of a product of matrices,</td><td>$(AB)^T = B^TA^T$</td>
</tr>    
</table>

---